# Pandas

#### 1) Array

In [2]:
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np

In [3]:
#Without passing index
#numpy array
arr = np.array(['a','b','c','d'])
print(arr)

['a' 'b' 'c' 'd']

In [4]:
#creating the series using numpy array
s = pd.Series(arr)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [5]:
#check the type
type(s)

pandas.core.series.Series

In [6]:
#by passing index.
#numpy array
arr = np.array(['a','b','c','d'])

#creating series
s = pd.Series(arr,index=[100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

#### 2) Dictionary

In [7]:
# Ex1)
data = {'a' : 0, 'b' : 1, 'c' : 2}
s = pd.Series(data)
s

a    0
b    1
c    2
dtype: int64

#### Scalar

In [8]:
# Create a Series from Scalar
s = pd.Series(5, index=[0, 1, 2, 3])
s

0    5
1    5
2    5
3    5
dtype: int64

### Accessing Data from Series

#### 1) By using the position

In [9]:
# Data in the series can be accessed similar to that in an ndarray.
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
#retrieve the first element
s[0]

1

In [11]:
# first 3 elements
s[0:3]   #[start,stop,step] # remember stop is exclusive

0    1
1    2
2    3
dtype: int64

In [12]:
# last 3 elements
s[-3:]

2    3
3    4
4    5
dtype: int64

#### 2) By using the keys

In [13]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
#retrieve a single element
s['a']

1

In [15]:
#retrieve a multiple elements
s[['a','b','c']]

a    1
b    2
c    3
dtype: int64

#### to get the indexes

In [17]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

#### to get the values

In [18]:
s.values

array([1, 2, 3, 4, 5], dtype=int64)

## DataFrame

In [19]:
# A basic DataFrame, which can be created is an Empty Dataframe.
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [20]:
# Ex1) without index
name = ['Ashay', 'Himanshu', 'Padam', 'Ravi']
age = [22,23,24,25]

# creating dictionary
data = {'Name':name,'Age':age}
print(data)
# passing dictionary to create df
df = pd.DataFrame(data)
df

{'Name': ['Ashay', 'Himanshu', 'Padam', 'Ravi'], 'Age': [22, 23, 24, 25]}

       Name  Age
0     Ashay   22
1  Himanshu   23
2     Padam   24
3      Ravi   25

In [21]:
#Ex2) with index
name = ['Ashay', 'Himanshu', 'Padam', 'Ravi']
age = [22,23,24,25]

# my new indexes
indexes = ['rank1','rank2','rank3','rank4']

#this is my dictionary
data = {'Name':name,'Age':age}

#passing dictionary to create dataframe
df = pd.DataFrame(data, index=indexes)
df

           Name  Age
rank1     Ashay   22
rank2  Himanshu   23
rank3     Padam   24
rank4      Ravi   25

### Column Selection

In [22]:
df['Age']

rank1    22
rank2    23
rank3    24
rank4    25
Name: Age, dtype: int64

In [23]:
df.Age

rank1    22
rank2    23
rank3    24
rank4    25
Name: Age, dtype: int64

### Column Addition

In [24]:
# say suppose you want to add city column 
city = ['Banglore','Pune','Hyderabad','Mumbai']

#adding new column named 'City'
df["City"] = city
df

           Name  Age       City
rank1     Ashay   22   Banglore
rank2  Himanshu   23       Pune
rank3     Padam   24  Hyderabad
rank4      Ravi   25     Mumbai

### Column Deletion

In [25]:
# 1) Using del keyword
del df["City"]
df

           Name  Age
rank1     Ashay   22
rank2  Himanshu   23
rank3     Padam   24
rank4      Ravi   25

In [26]:
# 2) Using pop function
df.pop('Age')
df

           Name
rank1     Ashay
rank2  Himanshu
rank3     Padam
rank4      Ravi